delete from _Reference366
where not _IDRRef in 
(
0x996C001E6751F03211E62102BB84A9A4,	-- Управленческая организация
0x8B48001E67B91B2511E6740F6654CAE6, -- ООО "Группа компаний Агроэко"
0x8B48001E67B91B2511E6737870E800CF, -- БФ "АГРОЭКО"
0x8B48001E67B91B2511E6740FD3FAEBCC,	--ООО "Тульская мясная компания"
0xB3E1001E67B91B2511E63F77F9E9356F,	--ООО "АГРОЭКО-ЦЕНТР"
0xB3E1001E67B91B2511E63F780DD6BB65,	--ООО "АГРОЭКО-ЮГ"
0x8B48001E67B91B2511E674109197B1A1,	--ООО "ЭКОМИКС"
0xB3E1001E67B91B2511E63F78265E0BE1,	--ООО "АПК АГРОЭКО"
0xB3E1001E67B91B2511E63F77901EBA51,	--ООО "АГРОЭКО-ВОСТОК"
0xB3E1001E67B91B2511E63F7728FE13E7,	--ООО "АГРОЭКО-ВОРОНЕЖ"
0xB3E1001E67B91B2511E63F77A6B77494,	--ООО "АГРОЭКО-Менеджмент"
0xB3E1001E67B91B2511E63F77E42758AC	--ООО "АГРОЭКО-ПЕРЕРАБОТКА" 

);

select * from _Reference366


